In [2]:
import pandas as pd

import json
import os

In [14]:
columns_payment = ['ClientId', 'AcquisitionDate', 'PaymentValue', 'Plan']
df_payment = pd.read_csv('../data/payments.csv', names=columns_payment)

In [15]:
df_payment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 95476 entries, 0 to 95475
Data columns (total 4 columns):
ClientId           95476 non-null int64
AcquisitionDate    95476 non-null object
PaymentValue       95476 non-null object
Plan               95476 non-null object
dtypes: int64(1), object(3)
memory usage: 2.9+ MB

In [16]:
df_payment.head()

   ClientId AcquisitionDate PaymentValue       Plan
0      4049      05/03/2017    R$ 300,00   Bronze/3
1      1711      12/08/2018    R$ 750,00     Ouro/3
2      3643      01/01/2017    R$ 399,00  Platina/1
3      4683      09/06/2017   R$ 2394,00  Platina/6
4      4645      25/04/2018    R$ 250,00     Ouro/1

In [17]:
# Splitting the Plan Column into two: "Plan" and "AcquiredMonths"
df_payment[['Plan', 'AcquiredMonths']] = df_payment.Plan.str.split('/', expand=True)

In [18]:
df_payment.head()

   ClientId AcquisitionDate PaymentValue     Plan AcquiredMonths
0      4049      05/03/2017    R$ 300,00   Bronze              3
1      1711      12/08/2018    R$ 750,00     Ouro              3
2      3643      01/01/2017    R$ 399,00  Platina              1
3      4683      09/06/2017   R$ 2394,00  Platina              6
4      4645      25/04/2018    R$ 250,00     Ouro              1

In [22]:
# Cleaning and Transforming the PaymentValue Column
df_payment['PaymentValue'].apply(type).unique()

array([<class 'str'>], dtype=object)

In [34]:
df_payment['PaymentValue'] = df_payment['PaymentValue'].replace({'R\$': '', ',': '.'}, regex=True).astype(float)

In [35]:
df_payment.head()

   ClientId AcquisitionDate  PaymentValue     Plan AcquiredMonths
0      4049      05/03/2017         300.0   Bronze              3
1      1711      12/08/2018         750.0     Ouro              3
2      3643      01/01/2017         399.0  Platina              1
3      4683      09/06/2017        2394.0  Platina              6
4      4645      25/04/2018         250.0     Ouro              1

In [39]:
df_payment['PlanValue'] = df_payment['PaymentValue']/df_payment['AcquiredMonths'].astype(int)

In [41]:
df_payment.head()

   ClientId AcquisitionDate  PaymentValue     Plan AcquiredMonths  PlanValue
0      4049      05/03/2017         300.0   Bronze              3      100.0
1      1711      12/08/2018         750.0     Ouro              3      250.0
2      3643      01/01/2017         399.0  Platina              1      399.0
3      4683      09/06/2017        2394.0  Platina              6      399.0
4      4645      25/04/2018         250.0     Ouro              1      250.0

In [42]:
df_plan = df_payment[['Plan', 'PlanValue']].drop_duplicates()

In [43]:
df_plan.head()

       Plan  PlanValue
0    Bronze      100.0
1      Ouro      250.0
2   Platina      399.0
14    Prata      185.0